MD-Farma-Laravel-XAMPP/app/Filament/Admin/Resources/Conversations/Pages/ChatConversation.php

select * from `messages` where `messages`.`conversation_id` in (1)
---
    public function mount(Conversation $record): void
    {
        $this->record = $record->load(['patient', 'staff', 'messages.sender']);

        if ($this->record->staff_id === null) {
            $this->record->update([
                'staff_id' => Auth::id(),
            ]);

            $this->record->refresh();
            $this->record->load(['patient', 'staff', 'messages.sender']);

insert into `messages` (`conversation_id`, `sender_id`, `message`, `is_read`, `updated_at`, `created_at`) values (1, 3, 'apa mek\n', 0, '2026-07-22 17:53:54', '2026-07-22 17:53:54')
---
    public function sendMessage(): void
    {
        $this->validate([
            'message' => ['required', 'string', 'max:1000'],
        ]);

        if ($this->record->status === 'closed') {
            Notification::make()
                ->title('Konsultasi sudah ditutup')
                ->danger()
                ->send();

            return;
        }

        $message = Message::create([
            'conversation_id' => $this->record->id,
            'sender_id' => Auth::id(),
            'message' => $this->message,
            'is_read' => false,
        ]);