MD-Farma-Laravel-XAMPP/app/Http/Controllers/Admin/PatientController.php

    public function show(User $patient): View
    {
        abort_unless($patient->isPatient(), 404);

        $patient->load(['patientProfile', 'patientConversations.doctor']);
---
select * from `conversations` where `conversations`.`patient_id` in (3)