MD-Farma-Laravel-XAMPP/app/Http/Controllers/Auth/RegisterController.php

insert into `users` (`name`, `email`, `password`, `role`, `updated_at`, `created_at`) values ('pasien1', 'pasien1@gmail.com', '$2y$12$YbYFpL3pBaTvevoziNbruOIUZGyoNe0YH1/7fcYVnhetvgUIesQgy', 'pasien', '2026-07-23 12:08:53', '2026-07-23 12:08:53')
insert into `patient_profiles` (`user_id`, `phone`, `updated_at`, `created_at`) values (3, '0812345678', '2026-07-23 12:08:53', '2026-07-23 12:08:53')
---
        );

        $user = DB::transaction(function () use ($data): User {
            $user = User::create([
                'name' => $data['name'],
                'email' => $data['email'],
                'password' => $data['password'],
                'role' => User::ROLE_PATIENT,
            ]);

            PatientProfile::create([
                'user_id' => $user->id,
                'phone' => $data['phone'] ?? null,
            ]);