MD-Farma-Laravel-XAMPP/app/Http/Controllers/ChatController.php

    public function index(Request $request): View
    {
        $user = $request->user();

        $query = Conversation::query()->with(['patient', 'doctor']);

        if ($user->isPatient()) {
            $query->where('patient_id', $user->id);
        } elseif ($user->isDoctor()) {
            $query->where(function ($builder) use ($user) {
                $builder->whereNull('doctor_id')
                    ->orWhere('doctor_id', $user->id);
            });
        } else {
            abort(403);
        }

        $conversations = $query
            ->latest('last_message_at')
            ->paginate(15);
---
select count(*) as `aggregate` from `conversations` where (`doctor_id` is null or `doctor_id` = 2)

    public function storeConversation(Request $request): RedirectResponse
    {
        abort_unless($request->user()->isPatient(), 403);

        $data = $request->validate([
            'subject' => ['required', 'string', 'max:150'],
            'message' => ['required', 'string', 'max:3000'],
        ]);

        $conversation = DB::transaction(function () use ($request, $data): Conversation {
            $conversation = Conversation::create([
                'patient_id' => $request->user()->id,
                'subject' => $data['subject'],
                'status' => 'open',
                'last_message_at' => now(),
            ]);

            Message::create([
                'conversation_id' => $conversation->id,
                'sender_id' => $request->user()->id,
                'body' => $data['message'],
            ]);
---
insert into `conversations` (`patient_id`, `subject`, `status`, `last_message_at`, `updated_at`, `created_at`) values (3, 'darah tinggi', 'open', '2026-07-23 12:10:22', '2026-07-23 12:10:22', '2026-07-23 12:10:22')
insert into `messages` (`conversation_id`, `sender_id`, `body`, `updated_at`, `created_at`) values (1, 3, 'saya mengalami pusing saaat melakukan aktivitas', '2026-07-23 12:10:22', '2026-07-23 12:10:22')

    public function show(Request $request, Conversation $conversation): View
    {
        $this->authorizeConversation($request, $conversation);

        if ($request->user()->isDoctor() && $conversation->doctor_id === null) {
            $conversation->update(['doctor_id' => $request->user()->id]);
        }

        $conversation->load(['patient.patientProfile', 'doctor', 'messages.sender']);

        Message::query()
            ->where('conversation_id', $conversation->id)
            ->where('sender_id', '!=', $request->user()->id)
            ->whereNull('read_at')
            ->update(['read_at' => now()]);
---
select * from `messages` where `messages`.`conversation_id` in (1) order by `created_at` asc
select * from `patient_profiles` where `patient_profiles`.`user_id` in (3)
select * from `users` where `users`.`id` in (3)
update `messages` set `read_at` = '2026-07-23 12:10:22', `messages`.`updated_at` = '2026-07-23 12:10:22' where `conversation_id` = 1 and `sender_id` != 3 and `read_at` is null

    public function messages(Request $request, Conversation $conversation): JsonResponse
    {
        $this->authorizeConversation($request, $conversation);

        $afterId = max(0, $request->integer('after_id'));

        $messages = $conversation->messages()
            ->with('sender:id,name,role')
            ->where('id', '>', $afterId)
            ->get()
            ->map(fn (Message $message) => [
                'id' => $message->id,
                'sender_id' => $message->sender_id,
                'sender_name' => $message->sender->name,
                'sender_role' => $message->sender->role,
                'body' => $message->body,
                'time' => $message->created_at->format('H:i'),
            ]);
---
select * from `messages` where `messages`.`conversation_id` = 1 and `messages`.`conversation_id` is not null and `id` > 1 order by `created_at` asc