MD-Farma-Laravel-XAMPP/app/Http/Controllers/ChatController.php

    public function index(): View
    {
        /**
         * Halaman /konsultasi hanya untuk user dengan role pasien.
         * Jadi admin/apoteker tidak menggunakan halaman ini.
         */
        if (! Auth::user()->hasRole('pasien')) {
            abort(403, 'Halaman konsultasi hanya untuk pasien.');
        }

        $conversation = Conversation::query()
            ->where('patient_id', Auth::id())
            ->where('status', 'open')
            ->latest()
            ->first();

        if (! $conversation) {
            $conversation = Conversation::create([
                'patient_id' => Auth::id(),
                'staff_id' => null,
                'subject' => 'Konsultasi Obat',
                'status' => 'open',
            ]);
        }

        $messages = $conversation->messages()
            ->with('sender')
            ->oldest()
            ->get();
---
select * from `conversations` where `patient_id` = 3 and `status` = 'open' order by `created_at` desc limit 1
insert into `conversations` (`patient_id`, `staff_id`, `subject`, `status`, `updated_at`, `created_at`) values (3, null, 'Konsultasi Obat', 'open', '2026-07-22 17:45:27', '2026-07-22 17:45:27')
select * from `messages` where `messages`.`conversation_id` = 1 and `messages`.`conversation_id` is not null order by `created_at` asc

    public function send(Request $request, Conversation $conversation): JsonResponse
    {
        /**
         * Hanya pasien yang boleh mengirim pesan dari halaman /konsultasi.
         * Admin/apoteker nanti membalas dari halaman Filament.
         */
        if (! Auth::user()->hasRole('pasien')) {
            abort(403, 'Hanya pasien yang dapat mengirim pesan dari halaman konsultasi.');
        }

        /**
         * Pastikan pasien hanya bisa mengirim pesan
         * ke conversation miliknya sendiri.
         */
        if ((int) $conversation->patient_id !== (int) Auth::id()) {
            abort(403, 'Anda tidak memiliki akses ke konsultasi ini.');
        }

        $request->validate([
            'message' => ['required', 'string', 'max:1000'],
        ]);

        if ($conversation->status === 'closed') {
            return response()->json([
                'success' => false,
                'message' => 'Konsultasi sudah ditutup.',
            ], 403);
        }

        $message = Message::create([
            'conversation_id' => $conversation->id,
            'sender_id' => Auth::id(),
            'message' => $request->message,
            'is_read' => false,
        ]);
---
insert into `messages` (`conversation_id`, `sender_id`, `message`, `is_read`, `updated_at`, `created_at`) values (1, 3, 'memek', 0, '2026-07-22 17:49:49', '2026-07-22 17:49:49')