MD-Farma-Laravel-XAMPP/app/Http/Controllers/DashboardController.php

    public function __invoke(Request $request): View|RedirectResponse
    {
        $user = $request->user();

        if ($user->isAdmin()) {
            return redirect()->route('admin.patients.index');
        }

        if ($user->isDoctor()) {
            $conversations = Conversation::query()
                ->with(['patient', 'messages' => fn ($query) => $query->latest()->limit(1)])
                ->where(function ($query) use ($user) {
                    $query->whereNull('doctor_id')
                        ->orWhere('doctor_id', $user->id);
                })
                ->latest('last_message_at')
                ->paginate(12);
---
select count(*) as `aggregate` from `conversations` where (`doctor_id` is null or `doctor_id` = 2)