MD-Farma-Laravel-XAMPP/app/Http/Controllers/Patient/ProfileController.php

select * from `patient_profiles` where `patient_profiles`.`user_id` = 3 and `patient_profiles`.`user_id` is not null limit 1
---
    public function edit(Request $request): View
    {
        $profile = $request->user()->patientProfile()->firstOrCreate([]);

select * from `patient_profiles` where `patient_profiles`.`user_id` = 3 and `patient_profiles`.`user_id` is not null limit 1
update `patient_profiles` set `birth_date` = '2001-02-14 00:00:00', `gender` = 'laki-laki', `address` = 'jalan pemda nomor 3', `allergies` = 'alergi kacang', `medical_history` = 'diabetes', `current_medications` = 'amlodiin', `patient_profiles`.`updated_at` = '2026-07-23 12:09:48' where `id` = 1
---
    public function update(Request $request): RedirectResponse
    {
        $data = $request->validate([
            'birth_date' => ['nullable', 'date', 'before:today'],
            'gender' => ['nullable', Rule::in(['laki-laki', 'perempuan'])],
            'phone' => ['nullable', 'string', 'max:25'],
            'address' => ['nullable', 'string', 'max:1000'],
            'blood_type' => ['nullable', Rule::in(['A', 'B', 'AB', 'O', '-'])],
            'allergies' => ['nullable', 'string', 'max:2000'],
            'medical_history' => ['nullable', 'string', 'max:3000'],
            'current_medications' => ['nullable', 'string', 'max:3000'],
        ]);

        $request->user()->patientProfile()->updateOrCreate([], $data);